In [3]:
#Create a dataframe, save it as a CSV file ,set index as random
import numpy as np
import pandas as pd
df=pd.DataFrame(np.random.randn(4, 4), columns = list('ABCD'))
df.to_csv('example.csv', index=False)

In [5]:
#2.Create dataframe,the merge it with a new column
import pandas as pd 
 
# Define a dictionary containing employee data 
data1 = {'Name':['Shashank', 'Sharat', 'Sushma'], 
        'Age':[23, 22, 23], 
        'Address':['Solapur', 'Gulbarga', 'Bengaluru'], 
        'Qualification':['Eng', 'Bsc', 'CA']} 
   
# Define a dictionary containing employee data 
data2 = {'Name':['Naina', 'Chikki', 'Suman'], 
        'Age':[19, 25, 24], 
        'Address':['Pune', 'Bijapur', 'Delhi'], 
        'Qualification':['B.ed', 'B.com', 'MBBS']} 
 
# Convert the dictionary into DataFrame  
df = pd.DataFrame(data1,index=[0, 1, 2])
 
# Convert the dictionary into DataFrame  
df1 = pd.DataFrame(data2, index=[3,4, 5])
 
print(df, "\n\n", df1)

       Name  Age    Address Qualification
0  Shashank   23    Solapur           Eng
1    Sharat   22   Gulbarga           Bsc
2    Sushma   23  Bengaluru            CA

      Name  Age  Address Qualification
3   Naina   19     Pune          B.ed
4  Chikki   25  Bijapur         B.com
5   Suman   24    Delhi          MBBS

In [6]:
# using a .concat() method
frames = [df, df1]
 
res1 = pd.concat(frames)
res1

       Name  Age    Address Qualification
0  Shashank   23    Solapur           Eng
1    Sharat   22   Gulbarga           Bsc
2    Sushma   23  Bengaluru            CA
3     Naina   19       Pune          B.ed
4    Chikki   25    Bijapur         B.com
5     Suman   24      Delhi          MBBS